tests/load/baseline_console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/load/cache_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 50s max duration (incl. graceful stop):
              * default: 40 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 40/40 VUs, 600 complete and 0 interrupted iterations
default   [   5% ] 40 VUs  01.0s/20s

running (02.0s), 40/40 VUs, 1320 complete and 0 interrupted iterations
default   [  10% ] 40 VUs  02.0s/20s

running (03.0s), 40/40 VUs, 2014 complete and 0 interrupted iterations
default   [  15% ] 40 VUs  03.0s/20s

running (04.0s), 40/40 VUs, 2720 complete and 0 interrupted iterations
default   [  20% ] 40 VUs  04.0s/20s

running (05.0s), 40/40 VUs, 3480 complete and 0 interrupted iterations
default   [  25% ] 40 VUs  05.0s/20s

running (06.0s), 40/40 VUs, 4160 complete and 0 interrupted iterations
default   [  30% ] 40 VUs  06.0s/20s

running (07.0s), 40/40 VUs, 4884 complete and 0 interrupted iterations
default   [  35% ] 40 VUs  07.0s/20s

running (08.0s), 40/40 VUs, 5604 complete and 0 interrupted iterations
default   [  40% ] 40 VUs  08.0s/20s

running (09.0s), 40/40 VUs, 6324 complete and 0 interrupted iterations
default   [  45% ] 40 VUs  09.0s/20s

running (10.0s), 40/40 VUs, 7044 complete and 0 interrupted iterations
default   [  50% ] 40 VUs  10.0s/20s

running (11.0s), 40/40 VUs, 7764 complete and 0 interrupted iterations
default   [  55% ] 40 VUs  11.0s/20s

running (12.0s), 40/40 VUs, 8484 complete and 0 interrupted iterations
default   [  60% ] 40 VUs  12.0s/20s

running (13.0s), 40/40 VUs, 9204 complete and 0 interrupted iterations
default   [  65% ] 40 VUs  13.0s/20s

running (14.0s), 40/40 VUs, 9924 complete and 0 interrupted iterations
default   [  70% ] 40 VUs  14.0s/20s

running (15.0s), 40/40 VUs, 10604 complete and 0 interrupted iterations
default   [  75% ] 40 VUs  15.0s/20s

running (16.0s), 40/40 VUs, 11324 complete and 0 interrupted iterations
default   [  80% ] 40 VUs  16.0s/20s

running (17.0s), 40/40 VUs, 12051 complete and 0 interrupted iterations
default   [  85% ] 40 VUs  17.0s/20s

running (18.0s), 40/40 VUs, 12811 complete and 0 interrupted iterations
default   [  90% ] 40 VUs  18.0s/20s

running (19.0s), 40/40 VUs, 13531 complete and 0 interrupted iterations
default   [  95% ] 40 VUs  19.0s/20s

running (20.0s), 40/40 VUs, 14251 complete and 0 interrupted iterations
default   [ 100% ] 40 VUs  20.0s/20s


  █ TOTAL RESULTS 

    checks_total.......: 28582   1425.625679/s
    checks_succeeded...: 100.00% 28582 out of 28582
    checks_failed......: 0.00%   0 out of 28582

    ✓ status 200
    ✓ has X-Cache

    HTTP
    http_req_duration..............: avg=5.36ms  min=174µs   med=5.17ms  max=135.77ms p(90)=6.72ms  p(95)=7.76ms 
      { expected_response:true }...: avg=5.36ms  min=174µs   med=5.17ms  max=135.77ms p(90)=6.72ms  p(95)=7.76ms 
    http_req_failed................: 0.00%  0 out of 14291
    http_reqs......................: 14291  712.812839/s

    EXECUTION
    iteration_duration.............: avg=56.08ms min=50.25ms med=55.97ms max=190.61ms p(90)=57.51ms p(95)=58.48ms
    iterations.....................: 14291  712.812839/s
    vus............................: 40     min=40         max=40
    vus_max........................: 40     min=40         max=40

    NETWORK
    data_received..................: 2.9 MB 145 kB/s
    data_sent......................: 1.5 MB 73 kB/s



running (20.0s), 00/40 VUs, 14291 complete and 0 interrupted iterations
default ✓ [ 100% ] 40 VUs  20s